Mynderse-Research-Lab/wt32-eth01-FreeRTOS/idf/sdkconfig.defaults
# WT32-ETH01 default ESP-IDF configuration.
# Edit via `idf.py menuconfig` if needed; changes are written to sdkconfig.

CONFIG_IDF_TARGET="esp32"

# 4 MB flash (WT32-ETH01 standard module).
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# 240 MHz CPU for responsive motion-profile timer.
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=240

# Default UART console at 115200 (matches old monitor_speed).
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Enable C++ exceptions / RTTI so std::unique_ptr and virtual destructors
# behave as expected.
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=0
CONFIG_COMPILER_CXX_RTTI=y

# Keep log level at INFO by default (ESP_LOGD trace still compiled in, just
# filtered at runtime; set to DEBUG here if you want verbose PulseMotor logs).
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Main task stack - the app creates its own tasks via xTaskCreatePinnedToCore
# so the main task can stay modest.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# FreeRTOS tick at 1000 Hz so pdMS_TO_TICKS(1) is a real millisecond.
CONFIG_FREERTOS_HZ=1000

# W5500 EtherNet/IP daisy-chain: WT32 (.10) -> X (.20) -> Z (.21)
# Theta (.30) unpowered / not discoverable for now.
# X PORT1 uplink is mutually exclusive: WT32 XOR PC (never both).
CONFIG_EIP_SCANNER_ENABLED=y
CONFIG_EIP_W5500_IP="192.168.1.10"
CONFIG_EIP_W5500_SUBNET="255.255.255.0"
CONFIG_EIP_W5500_GATEWAY="192.168.1.1"
CONFIG_EIP_AXIS_X=y
CONFIG_EIP_AXIS_Z=y
CONFIG_EIP_TARGET_IP_X="192.168.1.20"
CONFIG_EIP_TARGET_IP_Z="192.168.1.21"
CONFIG_EIP_CONFIG_ASSEMBLY_INSTANCE=191
CONFIG_EIP_ORIGINATOR_VENDOR_ID=1
CONFIG_EIP_X_RPI_US=2000
CONFIG_EIP_TO_POINT_TO_POINT=y
# PUU/mm from drive PUU/motor-rev=2097152, leads 200/20 mm/rev:
#   X i=5: 2097152*5/200 = 52428.8
#   Z direct (i=1): 2097152*1/20 = 104857.6
# Re-check on bench with `puucal` after the actuators are mounted.
CONFIG_EIP_AXIS_X_PUU_PER_MM=52428.8
CONFIG_EIP_AXIS_Z_PUU_PER_MM=104857.6

#
# Gantry kinematics (idf.py menuconfig → "Gantry kinematics")
#
CONFIG_GANTRY_DEFAULT_SPEED_MM_PER_S=50
CONFIG_GANTRY_DEFAULT_SPEED_DEG_PER_S=30
CONFIG_GANTRY_DEFAULT_ACCEL_MM_PER_S2=3000
CONFIG_GANTRY_DEFAULT_DECEL_MM_PER_S2=3000
CONFIG_GANTRY_EIP_ASSUMED_STOP_DECEL_MM_S2=300
CONFIG_AXIS_X_LEAD_MM_PER_REV=200.0
CONFIG_AXIS_X_HARD_LIMIT_MIN_MM=0.0
CONFIG_AXIS_X_HARD_LIMIT_MAX_MM=550.0
CONFIG_AXIS_X_MAX_SPEED_MM_PER_S=500.0
CONFIG_AXIS_X_ACCEL_MM_PER_S2=3000.0
CONFIG_AXIS_X_DECEL_MM_PER_S2=3000.0
CONFIG_AXIS_X_POSITION_TOLERANCE_MM=0.08
CONFIG_AXIS_X_ENCODER_PPR=2097152
CONFIG_AXIS_X_MOTOR_REDUCER_RATIO=5.0
CONFIG_AXIS_X_HOMING_SPEED_PPS=8000
CONFIG_AXIS_Z_LEAD_MM_PER_REV=20.0
CONFIG_AXIS_Z_CRITICAL_RPM=3000
CONFIG_AXIS_Z_HARD_LIMIT_MIN_MM=0.0
CONFIG_AXIS_Z_HARD_LIMIT_MAX_MM=150.0
CONFIG_AXIS_Z_MAX_SPEED_MM_PER_S=500.0
CONFIG_AXIS_Z_ACCEL_MM_PER_S2=5000.0
CONFIG_AXIS_Z_DECEL_MM_PER_S2=5000.0
CONFIG_AXIS_Z_POSITION_TOLERANCE_MM=0.03
CONFIG_AXIS_Z_ENCODER_PPR=2097152
CONFIG_AXIS_Z_MOTOR_REDUCER_RATIO=1.0
# CONFIG_AXIS_Z_HAS_MOTOR_BRAKE is not set
CONFIG_AXIS_Z_HOMING_SPEED_PPS=8000
CONFIG_GANTRY_Z_DATUM_OFFSET_ABOVE_BED_MM=0.0
CONFIG_AXIS_THETA_OUTPUT_GEAR_RATIO=1.0
CONFIG_AXIS_THETA_HARD_LIMIT_MIN_DEG=-180.0
CONFIG_AXIS_THETA_HARD_LIMIT_MAX_DEG=180.0
CONFIG_AXIS_THETA_MAX_SPEED_DEG_PER_S=3600.0
CONFIG_AXIS_THETA_ACCEL_DEG_PER_S2=18000.0
CONFIG_AXIS_THETA_DECEL_DEG_PER_S2=18000.0
CONFIG_AXIS_THETA_POSITION_TOLERANCE_DEG=0.01
CONFIG_AXIS_THETA_ENCODER_PPR=36000
CONFIG_AXIS_THETA_MOTOR_REDUCER_RATIO=1.0
CONFIG_AXIS_THETA_HOMING_SPEED_PPS=6000
CONFIG_GANTRY_Z_AXIS_Y_OFFSET_MM=80.0
CONFIG_GANTRY_THETA_X_OFFSET_MM=-55.0
CONFIG_GANTRY_GRIPPER_X_OFFSET_MM=385.0
CONFIG_GANTRY_GRIPPER_Z_OFFSET_MM=80.0
CONFIG_GANTRY_SAFE_Z_HEIGHT_MM=150.0
CONFIG_GANTRY_GRIPPER_OPEN_TIME_MS=190
CONFIG_GANTRY_GRIPPER_CLOSE_TIME_MS=150

# LAN8720 plant Ethernet (MQTT + TCP console) — menuconfig "LAN8720 plant Ethernet"
CONFIG_ETH_USE_STATIC_IP=y
CONFIG_ETH_STATIC_IP="192.168.1.100"
CONFIG_ETH_STATIC_GATEWAY="192.168.1.5"
CONFIG_ETH_STATIC_NETMASK="255.255.255.0"
CONFIG_ETH_IP_WAIT_TIMEOUT_MS=3000

# TCP gantry console — menuconfig "TCP gantry console (LAN8720)"
CONFIG_CONSOLE_TCP_ENABLE=y
CONFIG_CONSOLE_TCP_PORT=2323
CONFIG_CONSOLE_TCP_AUTH_ENABLE=y
CONFIG_CONSOLE_TCP_PASSWORD="LTU_1932"
CONFIG_CONSOLE_TCP_AUTH_MAX_TRIES=3
CONFIG_CONSOLE_TCP_AUTH_REMEMBER_S=600
CONFIG_CONSOLE_TCP_AUTH_REMEMBER_MAX=4

# Ethernet + MQTT defaults for WT32-ETH01 (LAN8720 over RMII).
# WT32 uses external 50 MHz into GPIO0 (CLK_IN); do not output CLK on GPIO17
# (GPIO17 is W5500 MOSI in this pin map).
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y
CONFIG_ETH_RMII_CLK_INPUT=y
CONFIG_ETH_MDC_GPIO=23
CONFIG_ETH_MDIO_GPIO=18
CONFIG_LWIP_IPV4=y
CONFIG_MQTT_TRANSPORT_OVER_TCP=y
CONFIG_MQTT_PROTOCOL_311=y
